#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 0s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=DmBzkfuQ3dCVxdfFMA]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=zECuUAG4l4hpD1SCtA]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=LWLhnRB7mH7sy4EMRA]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"]: Refreshing state... [id=8SCJ_y9BQ8y_uZUgtw]
module.vpn_routing.apstra_datacenter_connectivity_template_interface.vpn: Refreshing state... [id=3cb88ba0-2bb7-11f0-9ae3-617073747261]
null_resource.force_redeploy: Refreshing state... [id=9083482116004217490]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "9083482116004217490" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "26" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "4eefcfe6-87bb-4c79-a52d-b571266507c7"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template_interface.vpn will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template_interface" "vpn" {
      ~ description  = "includes routing policies for [Vendor_A, Vendor_B, Vendor_C, Vendor_D]" -> "includes routing policies for [Vendor_A, Vendor_B, Vendor_C]"
        id           = "3cb88ba0-2bb7-11f0-9ae3-617073747261"
      ~ ip_links     = {
          ~ "IP handoff to VPN router" = {
              ~ bgp_peering_ip_endpoints = {
                  ~ "BGP peering with VPN router" = {
                        id               = "815a0608-2bb7-11f0-94c8-617073747261"
                      ~ routing_policies = {
                          - "Vendor_D" = {
                              - id                = "1b0b24f2-2bb9-11f0-a892-617073747261" -> null
                              - pipeline_id       = "1b0b24fc-2bb9-11f0-a892-617073747261" -> null
                              - routing_policy_id = "8SCJ_y9BQ8y_uZUgtw" -> null
                            },
                            # (3 unchanged elements hidden)
                        }
                        # (4 unchanged attributes hidden)
                    },
                }
                id                       = "3cb88c0e-2bb7-11f0-9ae3-617073747261"
                # (5 unchanged attributes hidden)
            },
        }
        name         = "IP+BGP handoff to VPN block"
        tags         = [
            "terraform",
            "test",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"] will be updated in-place
  ~ resource "apstra_datacenter_routing_policy" "vpn" {
      ~ extra_exports       = [
          ~ {
              ~ prefix = "10.5.16.0/22" -> "10.5.0.0/22"
                # (1 unchanged attribute hidden)
            },
            # (1 unchanged element hidden)
        ]
        id                  = "LWLhnRB7mH7sy4EMRA"
        name                = "Vendor_C"
        # (7 unchanged attributes hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"] will be destroyed
  # (because key ["Vendor_D"] is not in for_each map)
  - resource "apstra_datacenter_routing_policy" "vpn" {
      - blueprint_id        = "4eefcfe6-87bb-4c79-a52d-b571266507c7" -> null
      - description         = "Vendor_D: Import count: 1 Export count: 3" -> null
      - expect_default_ipv4 = true -> null
      - expect_default_ipv6 = true -> null
      - export_policy       = {
          - export_l2_edge_subnets        = false -> null
          - export_l3_edge_server_links   = false -> null
          - export_loopbacks              = false -> null
          - export_spine_leaf_links       = false -> null
          - export_spine_superspine_links = false -> null
          - export_static_routes          = false -> null
        } -> null
      - extra_exports       = [
          - {
              - action = "permit" -> null
              - prefix = "10.5.0.0/24" -> null
            },
          - {
              - action = "permit" -> null
              - prefix = "10.5.7.0/24" -> null
            },
          - {
              - action = "permit" -> null
              - prefix = "10.5.64.0/22" -> null
            },
        ] -> null
      - extra_imports       = [
          - {
              - action = "permit" -> null
              - prefix = "172.19.0.0/24" -> null
            },
        ] -> null
      - id                  = "8SCJ_y9BQ8y_uZUgtw" -> null
      - import_policy       = "extra_only" -> null
      - name                = "Vendor_D" -> null
    }

Plan: 1 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   